--#1
SELECT Н_ОЦЕНКИ.ПРИМЕЧАНИЕ,Н_ВЕДОМОСТИ.ИД
FROM Н_ОЦЕНКИ
LEFT JOIN Н_ВЕДОМОСТИ ON Н_ОЦЕНКИ.КОД = Н_ВЕДОМОСТИ.ОЦЕНКА
WHERE Н_ОЦЕНКИ.КОД<'осв' 
AND Н_ВЕДОМОСТИ.ЧЛВК_ИД<105590 AND Н_ВЕДОМОСТИ.ЧЛВК_ИД=105590;

--#2
SELECT Н_ЛЮДИ.ИМЯ, Н_ВЕДОМОСТИ.ЧЛВК_ИД, Н_СЕССИЯ.УЧГОД
FROM Н_ЛЮДИ
JOIN Н_ВЕДОМОСТИ ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
JOIN Н_СЕССИЯ ON Н_ЛЮДИ.ИД = Н_СЕССИЯ.ЧЛВК_ИД
WHERE Н_ЛЮДИ.ФАМИЛИЯ>'Иванов' AND Н_ВЕДОМОСТИ.ЧЛВК_ИД=153285;

--#3
SELECT COUNT(*) AS ЧИСЛО_ДНЕЙ_БЕЗ_ПОВТОРЕНИЙ
FROM (
    SELECT Н_СЕССИЯ.ДАТА 
    FROM Н_СЕССИЯ GROUP BY Н_СЕССИЯ.ДАТА) AS a;

--#4
SELECT ПЛАН_КОЛВО_ГРУПП.ПЛАН_ИД FROM (
            SELECT ГРУППА_ПЛАН_ОТД.ПЛАН_ИД,COUNT(DISTINCT ГРУППА_ПЛАН_ОТД.ГРУППА) FROM
                                (SELECT Н_ГРУППЫ_ПЛАНОВ.ПЛАН_ИД,Н_ГРУППЫ_ПЛАНОВ.ГРУППА,Н_ОТДЕЛЫ.ИМЯ_В_ИМИН_ПАДЕЖЕ
                                FROM Н_ГРУППЫ_ПЛАНОВ
                                JOIN Н_ПЛАНЫ ON Н_ГРУППЫ_ПЛАНОВ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
                                JOIN Н_ОТДЕЛЫ ON Н_ПЛАНЫ.ОТД_ИД = Н_ОТДЕЛЫ.ИД 
                                WHERE Н_ОТДЕЛЫ.ИМЯ_В_ИМИН_ПАДЕЖЕ = 'кафедра вычислительной техники') AS ГРУППА_ПЛАН_ОТД
            GROUP BY ГРУППА_ПЛАН_ОТД.ПЛАН_ИД
            HAVING COUNT(DISTINCT ГРУППА_ПЛАН_ОТД.ГРУППА)>2) AS ПЛАН_КОЛВО_ГРУПП;

--#5

SELECT Н_УЧЕНИКИ.ГРУППА,AVG(date_part('year',AGE(Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ))) AS СРЕДНИЙ_ВОЗРАСТ FROM Н_ЛЮДИ
JOIN Н_ОБУЧЕНИЯ ON Н_ЛЮДИ.ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
JOIN Н_УЧЕНИКИ ON Н_ОБУЧЕНИЯ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
GROUP BY Н_УЧЕНИКИ.ГРУППА
HAVING AVG(date_part('year',AGE(Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ)))>(SELECT MAX(date_part('year',AGE(Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ))) FROM Н_ЛЮДИ
                                                        JOIN Н_ОБУЧЕНИЯ ON Н_ЛЮДИ.ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
                                                        JOIN Н_УЧЕНИКИ ON Н_ОБУЧЕНИЯ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
                                                        WHERE Н_УЧЕНИКИ.ГРУППА = '1101');

--#6
SELECT Н_УЧЕНИКИ.ГРУППА, Н_ЛЮДИ.ИД,
Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ,Н_ЛЮДИ.ОТЧЕСТВО,
Н_УЧЕНИКИ.П_ПРКОК_ИД, Н_УЧЕНИКИ.СОСТОЯНИЕ
FROM Н_УЧЕНИКИ
JOIN Н_ОБУЧЕНИЯ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
JOIN Н_ЛЮДИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
JOIN Н_ФОРМЫ_ОБУЧЕНИЯ ON Н_ПЛАНЫ.ФО_ИД = Н_ФОРМЫ_ОБУЧЕНИЯ.ИД
JOIN Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ ON Н_ПЛАНЫ.НАПС_ИД = Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.НАПС_ИД
JOIN Н_НАПР_СПЕЦ ON Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.НС_ИД = Н_НАПР_СПЕЦ.ИД
    WHERE Н_УЧЕНИКИ.ПЛАН_ИД IN (SELECT Н_ПЛАНЫ.ИД FROM Н_ПЛАНЫ
    JOIN Н_ФОРМЫ_ОБУЧЕНИЯ ON Н_ПЛАНЫ.ФО_ИД = Н_ФОРМЫ_ОБУЧЕНИЯ.ИД
    WHERE Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ = 'Заочная' AND Н_ПЛАНЫ.КУРС=1) AND Н_НАПР_СПЕЦ.НАИМЕНОВАНИЕ = 'Программная инженерия'
    AND Н_УЧЕНИКИ.НАЧАЛО = '2012-09-01';

--#7
SELECT Н_ЛЮДИ.ИД,Н_ЛЮДИ.ФАМИЛИЯ,Н_ЛЮДИ.ИМЯ,Н_ЛЮДИ.ОТЧЕСТВО
FROM Н_ЛЮДИ
WHERE Н_ЛЮДИ.ИД NOT IN (SELECT Н_УЧЕНИКИ.ЧЛВК_ИД FROM Н_УЧЕНИКИ
    JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
    JOIN Н_ОТДЕЛЫ ON Н_ПЛАНЫ.ОТД_ИД = Н_ОТДЕЛЫ.ИД
    WHERE Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'КТиУ');